Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་དག་ཐམས་ཅད་ཀྱི་རེ་ཞིག་ལན་གདབ་པར་བྱ་བ་ལ་འདི་གང་ཡིན་ཞེས་བྱ་བ་སྔར་དྲིས་པའི་ལན་དུ། དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་ཅིང་དེ་ལྟར་ངེས་པར་སེམས་པའི་ཚེ།
en: It says “when they investigate and ponder” the responses that have to be made to all those “like that”— as in the response to the above question “what is it?”— “

source: གལ་ཏེ་འདི་ལྟར་ཆོས་མེད་ཅིང་མི་དམིགས་པ་གང་ཡིན་པ་དེ།
en: if… they see that the dharma that does not exist and that they do not find is the perfection of wisdom they still do not see it.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: If they thus see that the dharma that does not exist and is not found is the perfection of wisdom, that too is not seeing.

source: ཅི་ལས་དགོངས་ཤེ་ན།
en: What does this intend?

source: དེའི་ཚེ་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་དེའི་ངོ་བོ་ཉིད་ཀྱང་ནམ་མཁའ་བཞིན་དུ་འགྱུར་ཏེ། དེ་བས་ན་གང་གིས་དེ་ལ་བལྟས་ན། རང་བཞིན་མེད་པར་མཐོང་བ་དེ་ཡང་དག་པར་མཐོང་བའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that at that time even the intrinsic nature of all dharmas that cannot be apprehended is like space, so, when that which has viewed it is a seeing without an intrinsic nature, it is a perfect seeing.

source: །དེ་བས་ན་བཅོམ་ལྡན་འདས་འདི་ལྟར་ཆོས་ཐམས་ཅད་མ་མཆིས་ཤིང་མི་དམིགས་སོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “because, Lord, all dharmas do not exist and are not found.”

source: དེའི་གནས་སྐབས་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means during that period.

source: །དེ་ལྟར་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པར་མཐོང་ན། གང་ལ་ཞུམ་པ་དང་། སྐྲག་པ་ལ་སོགས་པ་མེད་པར་གྱུར་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ཡིན་པར་ཤེས་པར་བྱའོ་ཞེས་གནས་བརྟན་རབ་འབྱོར་གྱིས་སྨྲས་པ་ལ། གནས་བརྟན་ཤཱ་རིའི་བུས་མ་བྲལ་བའི་མཚན་ཉིད་བསྟན་པར་བྱ་བའི་ཕྱིར། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ཡིན་པར་རིག་པར་བྱ་ཞེས་དྲིས་སོ།
en: When the elder Subhūti says “you should know” that those who, when they see that all dharmas, form and so on, are not real things, “are not cowed… and do not tremble,” and so on, are not separated from the knowledge of all aspects, the elder Śāriputra, to teach the mark of nonseparation, asks, “Venerable Subhūti, why should you know that they are not separated from the knowledge of all aspects?”

source: །དེའི་ཚེ་གནས་བརྟན་རབ་འབྱོར་གྱིས། གང་གི་ཕྱིར་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བ་དེའི་ཕྱིར་དེ་ལྟར་མཐོང་བ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བར་རིག་པར་བྱའོ་ཞེས་བསྟན་ཏོ།
en: At that point the elder Subhūti says that because all dharmas are separated from an intrinsic nature, therefore “you should know” that those who see that this is so “are not separated from the knowledge of all aspects.”

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ན་འདི་ལྟར་གཟུགས་ལ་གཟུགས་ཀྱི་རང་བཞིན་མེད་ཅེས་བྱ་བ་ལ་སོགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་གང་གི་ཡིན་ཞེས་དྲིས་པའི་ལན་བཤད་པ་ཡིན་ཏེ།
en: With, “Venerable Śāriputra, because of this one of many explanations, form does not have the intrinsic nature of form,” and so on, he answers the question “of what” is it the perfection of wisdom?

source: དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་ངོ་བོ་ཉིད་དང་བྲལ་བས་དངོས་པོ་མེད་པ་ཡིན་ན། འོ་ན་ཆོས་གང་རྟོགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་བསྟན་པ་ཡིན།
en: Given that all dharmas are not real things because they are separated from an intrinsic nature, what dharmas does it then realize so that it is taught to be “the perfection of wisdom”?

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་གཟུགས་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས་གང་འདི་ལ་སློབ་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཅིའི་ཕྱིར་ཞེས་བྱ་བ་བསྟན་པ་སྟེ།
en: From, “Furthermore, Venerable Śāriputra, form does not have the defining mark of form,” up to those “who are training in this… go forth to the knowledge of all aspects,” teaches why it is a perfection of wisdom.

source: ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་རྟོགས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བར་རྣམ་པར་གཞག་གོ།
en: It is posited as “the perfection of wisdom” because it realizes the marks of all dharmas.

source: །གལ་ཏེ་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་ཅིང་མཚན་ཉིད་དང་བྲལ་བ་ཡིན་ན། མཚན་ཉིད་གང་དག་རྟོགས་པར་འགྱུར་ཞེས་བསྟན་པ་ཡིན་ཏེ།
en: This is teaching that if all dharmas have no marks and are separated from marks, what are the marks it realizes?

source: འདི་ལྟར་མཚན་ཉིད་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པ་ཡོད་པ་མ་ཡིན་པས། དེའི་ཕྱིར། ཆོས་ཉིད་ནི་གཟུགས་ལ་སོགས་པའི་མཚན་ཉིད་དང་བྲལ་བ་ཞེས་བྱའོ།
en: It is saying because all marks are falsely imagined, are nonexistent, therefore the true nature of dharmas is separated from the mark of form and so on.

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་གང་བསླབ་པ་འདི་ལ་སློབ་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ་ཞེས་བྱ་བ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཉེ་བར་གྱུར་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཅི་ཞིག་ན་ཞེས་བྱ་བ་དེ་བསྟན་པ་སྟེ།
en: From, “Venerable Subhūti, do bodhisattva great beings training in this training go forth to the knowledge of all aspects?” up to, “Venerable Śāriputra, bodhisattva great beings thus practicing the perfection of wisdom are near unsurpassed, perfect, complete awakening” teaches what this perfection of wisdom is for.

source: ངེས་པར་འབྱིན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: It is a “perfection of wisdom” because it causes an escape.

source: །ངེས་པར་འབྱུང་བ་དེ་ཡང་ཆོས་ཐམས་ཅད་ལ་མེད་དེ།
en: That escape, furthermore, is not to all dharmas, “because all dharmas have not been produced and have not gone forth.”

source: འདི་ལྟར་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་ཅིང་ངེས་པར་འབྱུང་བ་མེད་པས་དེའི་ཕྱིར་དེ་ཡང་དེའི་ངེས་པར་འབྱིན་པར་མི་འགྱུར་རོ་ཞེས་བསྟན་པ་ཡིན་ནོ།
en: Hence it is also teaching that it also does not cause an escape. “

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāriputra… form is empty of form.

source: དེ་ལ་སྐྱེ་བ་དང་།
en: You cannot get at its production and going forth.”

source: ངེས་པར་འབྱུང་བ་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་སྟེ། དེའི་ཕྱིར་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་ནི་འཁོར་བའི་གནས་སྐབས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་ངོ་བོ་ཉིད་སྐྱེ་བ་དང་། འབྱུང་བ་མེད་དོ། །དག་པའི་གནས་སྐབས་ན་རྣམ་པར་བྱང་བའི་བདག་ཉིད་ལ་ཕྱིན་ཅི་ལོག་གི་དངོས་པོ་མེད་པས་གློ་བུར་གྱིས་ངེས་པར་འབྱུང་བ་མེད་དེ། ངོ་བོ་ཉིད་ཀྱི་རྣམ་པར་དག་པ་དང་།
en: This means that because the thoroughly established true dharmic nature of form is empty of the intrinsic nature of falsely imagined form, therefore there is no production and going forth of a defiled nature during the period of saṃsāra, and no mistaken entity exists in the purified nature during the purified period.

source: ཆོས་ཉིད་ལ་འགྱུར་བ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Hence a going forth plucked out of thin air does not exist, because in its intrinsic nature it is purity, and the true nature of dharmas does not change.

source: །སྐྱེ་བ་མེད་ཅེས་བྱ་བ་ནི་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ནའོ། །ངེས་པར་འབྱུང་བ་མེད་ཅེས་བྱ་བ་ནི་དྲི་མ་མེད་པའི་གནས་སྐབས་ནའོ།
en: It “has not been produced” during the period when it has stains, and it “has not gone forth” during the period when it is stainless.

source: །དེ་ལྟར་ཡོངས་སུ་བརྟགས་པའི་སྒྲུབ་པ་བསྟན་ནས། དེའི་འོག་ཏུ་བརྩོན་པར་སྒྲུབ་པ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་ཐབས་མི་མཁས་པས་གཟུགས་ལ་སྤྱོད་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་ལ་ཐུག་པའི་གཞུང་གིས་བཤད་དེ།
en: Practice of method Having thus taught the practice that has made a full investigation, next, to teach the practice as perseverance is the passage from where it says, “Lord, if bodhisattva great beings practicing the perfection of wisdom without skillful means practice form,” and so on, up to the end: “Śāriputra… they… bodhisattva great beings… are close to the knowledge of all aspects.”

source: བརྩོན་པར་བསྒྲུབ་པ་འདི་ཡང་ཐབས་མ་ཡིན་པ་སྤང་བར་བྱ་བ་དང་། ཐབས་ལ་བརྟེན་པར་བྱ་བ་དང་། རྣམ་པ་གཉིས་སུ་བསྟན་ཏོ།
en: This practice as perseverance is also taught in two parts: the lack of method that has to be eliminated, and the method that has to be resorted to.

source: །ཐབས་མ་ཡིན་པ་ཡང་རྣམ་པ་གཉིས་ཀྱིས་བསྟན་ཏེ། མཚན་མ་ལ་སྤྱོད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པའོ།
en: The lack of method is explained in two parts as well: the practice of causal signs, and the practice of enactment.

source: །ཐབས་ཀྱང་རྣམ་པ་གཉིས་ཀྱིས་བསྟན་ཏེ། ཆོས་ལ་སྤྱོད་པ་མེད་པ་དང་། ཆོས་ཀྱི་མཚན་མ་ལ་སྤྱོད་པ་མེད་པའོ།
en: The method to be resorted to is also explained in two parts: not practicing dharmas, and not practicing the causal signs of dharmas.

source: །དེ་ལ་ཐབས་མ་ཡིན་པས་མཚན་མ་ལ་སྤྱོད་པ་ནི་གཟུགས་ལ་སྤྱོད་པ་ན་མཚན་མ་ལ་སྤྱོད་པ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་མི་མཁས་པར་རིག་པར་བགྱིའོ་ཞེས་བྱ་བའི་བར་གྱིས་བཤད་དོ། །ཐབས་མ་ཡིན་པས་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པ་ནི།
en: Among these, the practice of causal signs because of lacking method is from “if… without skillful means [bodhisattva great beings] practice form they practice a causal sign; they do not practice the perfection of wisdom,” up to where it says, “You should know that this is the bodhisattva great beings’ lack of skillful means.”

source: གཟུགས་ལ་གནས་ཤིང་ཀུན་ཏུ་ཤེས་ཏེ་མོས་ན་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན་ཐབས་མི་མཁས་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གྱིས་བཤད་དོ།
en: The practice of enactment because of lacking method starts from where it says “possess, form a notion of, and believe in form,” and is up to, “Venerable Śāriputra, you should know that bodhisattva great beings practicing the perfection of wisdom like that are without skillful means.”

source: །གནས་ཞེས་བྱ་བ་ནི་སེམས་ཕྱིན་ཅི་ལོག་གིས་སོ། །ཀུན་ཏུ་ཤེས་ཞེས་བྱ་བའི་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་གིས་སོ།
en: They “possess” because of mental error, “form a notion” because of perceptual error, and “believe” because of philosophical error.

source: །ཆོས་ཞེས་བྱ་བ་ནི་ལྟ་བ་ཕྱིན་ཅི་ལོག་གིས་སོ། །ཐབས་ཀྱི་སྒྲུབ་པ་ལ་ཆོས་མི་དམིགས་པར་སྤྱོད་པ་ནི། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་གཟུགས་ལ་མི་སྤྱོད་ཅེས་བྱ་བ་ནས་བཟུང་སྟེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི་ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གྱིས་བཤད་དོ།
en: For the practice of method, the practice without apprehending dharmas starts from where it says, “Venerable Śāriputra… when bodhisattva great beings practice the perfection of wisdom they do not practice form,” and goes up to, “Venerable Śāriputra, when bodhisattva great beings practice the perfection of wisdom like that you should know that they have skillful means.”

source: །འདི་ལ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གོང་དུ་བཤད་ཟིན་པས་བཟླས་ཏེ་བཤད་མི་དགོས་སོ།
en: I have already explained “the emptiness of form is not form” and so on above, so there is no need to repeat the explanation here.

source: །ཐབས་ཀྱི་སྒྲུབ་པ་ལ་ཆོས་ཀྱི་མཚན་མ་མི་དམིགས་པར་སྤྱོད་པ་ནི། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་ཆོས་འགའ་ཞིག་དམིགས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་གྱིས་བཤད་དོ། །དེ་ལ་དམིགས་ཞེས་བྱ་བ་དང་། མི་དམིགས་ཞེས་བྱ་བ་དང་། དམིགས་ཀྱང་དམིགས་ལ་མི་དམིགས་ཀྱང་མི་དམིགས་ཞེས་བྱ་བ་དང་།
en: In the practice of method, practice without apprehending the causal signs of dharmas starts from where it says, “If, while practicing the perfection of wisdom they apprehend any dharma, they are not practicing the perfection of wisdom,” and goes up to “[those] bodhisattva great beings… are close to the knowledge of all aspects.”

source: དམིགས་པ་ཡང་མ་ཡིན་མི་དམིགས་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བའི་རྣམ་པར་རྟོག་པ་བཞི་ཡང་མཚན་མ་ཡིན་པ་དང་། སྤྱོད་དོ་ཞེས་བྱ་བ་དང་། མི་སྤྱོད་དོ་ཞེས་བྱ་བ་དང་། སྤྱོད་ཀྱང་སྤྱོད་ལ་མི་སྤྱོད་ཀྱང་མི་སྤྱོད་དོ་ཞེས་བྱ་བ་དང་། སྤྱོད་པ་ཡང་མ་ཡིན་མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་བཞི་ཡང་མཚན་མའོ་ཞེས་བྱ་བར་སྦྱར་བར་བྱའོ།
en: There, connect the four alternatives that “they apprehend… they do not apprehend… they apprehend when they apprehend and do not apprehend when they do not apprehend… and they neither apprehend nor not apprehend” with causal signs; and construe these four this way: “ ‘I am practicing,’… ‘I am not practicing,’… ‘I am practicing when I am practicing and not practicing when I am not practicing,’ and… ‘I am neither practicing nor not practicing’ ” with causal signs as well. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ངོ་བོ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་མེད་དོ།
en: The perfection of wisdom is without an intrinsic nature and cannot be found”— at the thoroughly established stage all dharmas cannot be apprehended, so even the perfection of wisdom does not exist on account of the perfection of wisdom’s own intrinsic nature.

source: །དེ་ལྟར་བརྩོན་པའི་སྒྲུབ་པ་བསྟན་ནས། ད་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་ཅེས་བྱ་བ་ལ་སོགས་པས་མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་སྒྲུབ་པ་སྟོན་ཏོ།
en: Practice for quickly fully awakening Having thus taught the practice of perseverance, now, with “furthermore… that knowledge of all aspects is not two and cannot be divided into two,” and so on, it teaches the practice for quickly fully awakening.

source: །སྒྲུབ་པ་འདི་ཡང་རྣམ་པ་བཞིར་བསྟན་ཏེ་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ལ་སློབ་པ་དང་། ཆོས་ཐམས་ཅད་མི་དམིགས་པར་སློབ་པ་དང་། སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པར་སློབ་པ་དང་། ཐབས་ལ་མཁས་པར་སློབ་པའོ།
en: This practice is also taught in four parts: training in the meditative stabilization spheres,training in not apprehending all dharmas,training in the illusion-like and so on, andtraining in skillful means.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཏིང་ངེ་འཛིན་ལ་བསླབ་པོ། །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སློབ་པའི་ཚེ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་ཅེས་བྱ་བ་ནས་བཟུང་སྟེ།
en: Among them, the training in meditative stabilizations starts from “because all dharmas are things that are not real, that knowledge of all aspects is not two and cannot be divided into two,” and goes up to “one should train in the applications of mindfulness.”

source: ཤཱ་རིའི་བུ་སྟོང་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་རིག་པར་བྱའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་གཞུང་གིས་ནི་ཆོས་ཐམས་ཅད་ལ་མི་དམིགས་པར་བསླབ་པ་བསྟན་ཏོ།
en: Training in not apprehending all dharmas is taught in the passage starting from where it says, “Śāriputra, when bodhisattva great beings train like that in the perfection of wisdom,” and “they train in the eighteen distinct attributes of a buddha, by way of not apprehending anything,” and so on, up to the end: “Śāriputra, they go forth to the knowledge of all aspects by way of not apprehending emptiness.”

source: །བཅོམ་ལྡན་འདས་ལ་ལ་ཞིག་འདི་སྐད་དུ་འདྲི་སྟེ་ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ་ཞེས་མཆིས་ནས་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་ནི་སྒྱུ་མ་ལྟ་བུ།
en: Training in the illusion-like and so on is taught in the passage starting from where it says, “Lord, suppose someone were to ask, ‘Does this illusory being, having trained in the perfection of wisdom, go forth to the knowledge of all aspects or reach the knowledge of all aspects?’ ”

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། རྣམ་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི་དབང་པོ་དྲུག་གོ།
en: up to, “Because, Lord, form is like an illusion, and feeling … perception… volitional factors… and consciousness is like an illusion, and what that consciousness is, the six faculties are.

source: །དེ་དག་ནི་ཕུང་པོ་ལྔའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པར་སློབ་པ་བསྟན་ཏོ།
en: They are the five aggregates.”

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་ཡིན་ལ། ཐབས་ཀྱང་མི་མཁས་པ་ཞིག་སྟེ་དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་ཡང་མ་སོང་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས་བཟུང་སྟེ། རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོ་ཡིན་པར་རིག་པར་བྱ་སྟེ། རིག་ནས་ཀྱང་ཡོངས་སུ་སྤང་བར་བྱའོ་ཞེས་བྱ་བའི་བར་ལ་ཐུག་པའི་གཞུང་གིས་ནི་ཐབས་མཁས་པ་བསྟན་ཏོ།
en: Skillful means is taught in the passage starting from where it says, “Subhūti… if they are bodhisattva great beings who have newly set out in the vehicle, and are those without skillful means who have not been taken in hand by a spiritual friend,” up to “someone… Subhūti, they should know is a bad friend of a bodhisattva great being.”

source: །དེ་ལ་ཏིང་ངེ་འཛིན་ལ་སློབ་པ་ཡང་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ། མིང་བཤད་པ་དང་། རྣམ་པར་མི་རྟོག་པ་བཤད་པའོ།
en: Training in the meditative stabilization spheres Among these, training in meditative stabilizations is taught in two parts: an explanation of the names and an explanation of nonconceptualization.

source: །དེ་ལ་མིང་བཤད་པ་ལ་ངོ་བོ་ཉིད་སྐྱེ་བ་མེད་པའི་ཏིང་ངེ་འཛིན་སྔར་བསྟན་པ་སྟེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པའི་གནས་སྐབས་ལ་བྱ་སྟེ། འདི་ལྟར་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་ལ། གཟུང་བ་དང་འཛིན་པ་གཉིས་སུ་མེད་པ་དང་། ཡོད་པ་དང་མེད་པ་དང་།
en: Among these, in regard to the explanation of names, it first teaches meditative stabilization in the form of nonproduction with, “Furthermore, because all dharmas are things that are not real, that knowledge of all aspects is not two and cannot be divided into two,” and so on.

source: དངོས་པོ་དང་དངོས་པོ་མེད་པ་དང་། རྟག་པ་དང་ཆད་པ་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་དང་། ཆོས་དང་ཆོས་མ་ཡིན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་དང་། གང་ཡང་རྟག་པ་དང་མི་རྟག་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་བ་དང་། བདག་དང་བདག་མེད་པ་དང་། ཞི་བ་དང་མ་ཞི་བ་དང་། སྟོང་པ་དང་མི་སྟོང་པ་དང་། མཚན་མ་དང་མཚན་མ་མེད་པ་དང་།
en: Construe “knowledge of all aspects” as the stage when all dharmas are not two, because for all imaginary dharmas there is bifurcation into grasped-object and grasper-subject, exist and does not exist, real thing and unreal thing, eternal and annihilated, compounded and uncompounded, dharma and nondharma, and so on, as well as into permanent and impermanent, pleasure and suffering, having a self and selfless, calm and not calm, empty and not empty, having a sign and signless, wished for and wishless, and so on.

source: སྨོན་པ་དང་སྨོན་པ་མེད་པ་ལ་སོགས་པ་གཉིས་པོ་དེ་དག་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པ་ཡིན་པས་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མེད་པའི་ཕྱིར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་གཉིས་སུ་མེད་པ་ཞེས་བྱའོ།
en: All those pairs are falsely imagined phenomena, and because they do not exist in the knowledge of all aspects it says the “knowledge of all aspects is not two.”

source: །རྟོག་པས་བྱས་པའི་དངོས་པོ་རྣམ་པ་གཉིས་མེད་པས་གཉིས་སུ་བྱར་མེད་པ་ཞེས་བྱའོ།
en: A real twofold thing arrived at through realization does not exist, so it says “cannot be divided into two.”

source: །ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་མིང་བརྗོད་པས། ཏིང་ངེ་འཛིན་ལ་གནས་པ་བསྟན་ནས། དེའི་འོག་ཏུ་རྣམ་པར་མི་རྟོག་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་པ་བསྟན་པའི་ཕྱིར། དེས་ནི་ཏིང་ངེ་འཛིན་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །བདག་ནི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ་ཞེས་བྱ་བར་ཏིང་ངེ་འཛིན་དེས་རློམ་སེམས་སུ་འགྱུར་བ་ཡང་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དོ།
en: Having taught abiding in meditative stabilization by giving the names of the meditative stabilizations, then, to teach abiding in nonconceptual meditative stabilization, it says “those… do not even see those meditative stabilizations, because they do not falsely project on account of those meditative stabilizations, ‘I have been absorbed,’ ” and so on.

source: །ཏིང་ངེ་འཛིན་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཉིད་ཙམ་དུ་འགྱུར་བའི་ཕྱིར་འདི་ནི་ཏིང་ངེ་འཛིན་ཏོ།
en: They “do not even see meditative stabilization” because it is the meditative stabilization at the thoroughly established stage when all dharmas have become just suchness.

source: །བདག་ནི་མཉམ་པར་གཞག་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཀུན་བརྟགས་པ་རྣམས་ཤིན་ཏུ་མེད་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་དུ་རྣམ་པར་རྟོག་པ་དང་། བདག་མཉམ་པར་གཞག་པར་རྣམ་པར་རྟོག་པ་དུས་ཀྱི་དབང་གིས་རྣམ་པ་གསུམ་དང་། སྙོམས་པར་འཇུག་པའི་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དེ་དག་མེད་དོ།
en: Because the falsely imagined “I will be in meditative equipoise” and so on are totally nonexistent, the threefold conceptualizations based on time periods of them as meditative stabilization and of oneself in meditative equipoise, and the conceptualization of entering into absorption and conceptualization do not exist.

source: །དེའི་ཕྱིར་དེ་ལ་རྣམ་པར་རྟོག་པ་དེ་དག་མེད་ཅེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says, “Those bodhisattva great beings do not conceive of those.”

source: །དེ་ཉིད་ཀྱི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཞན་ལ། ཏིང་ངེ་འཛིན་ཀྱང་གཞན་ཞིང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཏོ།
en: And just because of that it says, “The perfection of wisdom is not one thing, the meditative stabilization another, and the bodhisattva yet another.

source: །ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Bodhisattvas themselves are the meditative stabilization, and the meditative stabilization itself is the bodhisattva.”

source: ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཙམ་དུ་བདག་ཉིད་གཅིག་པའི་ཕྱིར་དེ་སྐད་ཅེས་བྱའོ།
en: It says that because all dharmas have the same nature as mere suchness.

source: །དེ་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: And just because of that, it says “because all dharmas are the same.” “

source: །ཏིང་ངེ་འཛིན་བསྟན་པར་ནུས་སམ་ཞེས་བྱ་བ་ནི་ཐ་དད་དུ་བྱས་ཏེ།
en: Is it possible to teach the meditative stabilization?”—

source: བརྗོད་པར་ནུས་སམ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ།
en: which is to say, is it possible to differentiate them and describe it?

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཏིང་ངེ་འཛིན་ཡིན་ནོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ་སྙམ་ནས་དྲིས་པ་དང་།
en: He asks, thinking that in that case the bodhisattvas themselves would be the meditative stabilizations.

source: ཏིང་ངེ་འཛིན་གྱི་མཚན་ཉིད་ཐ་དད་པ་མེད་པའི་ཕྱིར། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དེ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: In order to explain that the mark of a meditative stabilization is not different it says, “No indeed, Venerable Śāriputra.”

source: །དེ་ནས་གནས་བརྟན་ཤཱ་རིའི་བུས་གལ་ཏེ་ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་མིང་མེད་ན་ཅིའི་ཕྱིར་དེ་དག་གི་མིང་བརྗོད་སྙམ་དུ་བསམས་ནས། ཏིང་ངེ་འཛིན་དེ་རྣམས་ལ་འདུ་ཤེས་སུ་བྱེད་དམ་ཞེས་བྱ་བ་དྲིས་ཏེ།
en: Then the elder Śāriputra, wondering why, if the names of the meditative stabilizations do not exist, their names were given, asks, “Do they form a notion of those meditative stabilizations?”

source: ཇི་ལྟར་ཉན་ཐོས་བཞིན་དུ་ཞེས་དྲིས་པའོ།
en: He is asking, “Like śrāvakas do?”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་ལྟ་བུའི་རྟོག་པ་མེད་པའི་ཕྱིར། འདུ་ཤེས་སུ་བྱེད་པ་མེད་དོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then, because such mental construction does not exist, venerable Subhūti says, “They do not form such notions.”

source: །དེ་ནས་བཤད་པ་གཞན་གྱི་ཏིང་ངེ་འཛིན་བཤད་པ་བསྟན་པ་དང་། བྱ་བ་གཞན་གྱིས་བསྟན་པའི་ཕྱིར་ཇི་ལྟར་འདུ་ཤེས་སུ་བྱེད་པར་མི་འགྱུར་ཞེས་བྱ་བ་གསུངས་པ་དང་།
en: Then, because the explanation of the meditative stabilizations has been taught in one explanation and the activity taught in another, Śāriputra asks, “How do they not form such notions?”
